app/views/statistics/_list.html.haml

          %tr.trans{"id" => i}
            -if t.user.name.empty?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]