app/controllers/invites_controller.rb

  def index
    @invites = account.invites.where(status: 'pending')
---
SELECT "invites".* FROM "invites" WHERE "invites"."account_id" = $1 AND "invites"."status" = $2  [["account_id", 2], ["status", "pending"]]

  def create
    invite_pms = { user_from_id: current_user_id,
                   user_to_email: invite_params[:email],
                   account_id: params[:account_id] }
    if Invite.create_invite_with_rules(invite_params: invite_pms, rule_params: rule_params)
---
INSERT INTO "invites" ("account_id", "user_from_id", "user_to_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 11], ["user_from_id", 15], ["user_to_id", 16], ["created_at", "2021-02-08 18:50:25.600479"], ["updated_at", "2021-02-08 18:50:25.600479"]]
INSERT INTO "rules" ("created_at", "updated_at", "spending_limit") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2021-02-27 11:41:41.309964"], ["updated_at", "2021-02-27 11:41:41.309964"], ["spending_limit", "300.0"]]

  def set_account
    @account = Account.friendly.find(params[:account_id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."deleted_at" IS NULL AND "accounts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def set_invite
    @invite = Invite.find(params[:id] || params[:invite_id])
---
SELECT  "invites".* FROM "invites" WHERE "invites"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]